#+begin_src conf :tangle ./git_add.txt
  main.org
  pyproject.toml.bak
  sample/out_seeded.png
  sample/out_unseeded.png
  src/diffusers/pipelines/stable_diffusion/pipeline_stable_unclip_img2img_bak.py
  src/diffusers/pipelines/stable_diffusion/pipeline_stable_unclip_img2img.py
  unclip_seeded.org
  sample/in1.png
  sample/in2.png
#+end_src

#+begin_src sh :results output :shebang #!/bin/sh :tangle ./git_add.sh
  sed 's@^@("git" "add" "@g ; s@$@");@g' './git_add.txt' | '/bin/sh'
#+end_src

#+begin_src conf :tangle ./clean_rm.txt
  #main.org#
  .#main.org
  src/diffusers/pipelines/stable_diffusion/#pipeline_stable_diffusion_img2img.py#
  src/diffusers/pipelines/stable_diffusion/.#pipeline_stable_diffusion_img2img.py
#+end_src

#+begin_src sh :results output :shebang #!/bin/sh :tangle ./clean_rm.sh
  sed 's@^@("rm" "-vf" "--" "@g ; s@$@");@g' './clean_rm.txt' | '/bin/sh'
#+end_src

#+begin_src sh :results output :shebang #!/bin/sh :tangle ./git_update.sh
  ./git_add.sh
  ./clean_rm.sh
#+end_src

#+RESULTS:

#+begin_src sh :results output :shebang #!/bin/sh
  git status
#+end_src

#+RESULTS:
#+begin_example
On branch main
Your branch is up to date with 'origin/main'.

Changes to be committed:
  (use "git restore --staged <file>..." to unstage)
	modified:   main.org
	new file:   sample/in1.png
	new file:   sample/in2.png

Changes not staged for commit:
  (use "git add/rm <file>..." to update what will be committed)
  (use "git restore <file>..." to discard changes in working directory)
	deleted:    pyproject.toml

Untracked files:
  (use "git add <file>..." to include in what will be committed)
	clean_rm.sh
	clean_rm.txt
	git_add.sh
	git_add.txt
	git_rm.sh
	git_rm.txt
	git_update.sh

#+end_example

#+begin_src sh :results output :shebang #!/bin/sh
  MESSAGE='Added comparison between seeded and unseeded unclip works, the input images unsed are also included'
  git commit -m "${MESSAGE}."
#+end_src

#+RESULTS:
: [main 5102cc29] Added comparison between seeded and unseeded unclip works, the input images unsed are also included.
:  3 files changed, 9 insertions(+), 10 deletions(-)
:  create mode 100644 sample/in1.png
:  create mode 100644 sample/in2.png

#+begin_src sh :results output :shebang #!/bin/sh
  git push
#+end_src

#+RESULTS:
